Расширения/ПроцедурыИФункцииОбщихМодулейКонфигурации/DataProcessors/АМ_АнализФайловМодулейКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>АМ_АнализФайловМодулейКонфигурации</Name>
			<Comment>Загрузка текстов модулей в базу</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогФайловКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресМассиваОписанияМодулей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбраннаяКонфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьТолькоМодуль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьТолькоМетод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Расширения/ПроцедурыИФункцииОбщихМодулейКонфигурации/InformationRegisters/АМ_КаталогиФайловМодулейКонфигураций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>АМ_КаталогиФайловМодулейКонфигураций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КаталогПути</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширения/ПроцедурыИФункцииОбщихМодулейКонфигурации/DataProcessors/АМ_АнализФайловМодулейКонфигурации/Forms/АнализФайловМодулейКонфигурации/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыбратьКаталог()
	
	Если Не ЗначениеЗаполнено(Объект.ВыбраннаяКонфигурация) Тогда
		Сообщить("Сначала заполните конфигурацию.");
		Возврат;
	КонецЕсли;	
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ВыборФайла.ПроверятьСуществованиеФайла = Истина;
	ВыборФайла.Заголовок = "Выберите каталог размещения выгруженнной конфигурации ";
	Если НЕ ВыборФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли; 
	
	объект.КаталогФайловКонфигурации = ВыборФайла.Каталог;
	УстановитьКаталогВРегистр();
	

КонецПроцедуры

&НаСервере
Процедура УстановитьКаталогВРегистр()
	Если объект.КаталогФайловКонфигурации <> "" Тогда
		РегистрыСведений.АМ_КаталогиФайловМодулейКонфигураций.ЗаписатьКаталогПоКонфигурации(Объект.ВыбраннаяКонфигурация, объект.КаталогФайловКонфигурации);
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура КаталогФайловКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьКаталог();
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаТекстовМодулейНаСервере(ПараметрыЗапуска)
	
	АМ_РаботаСТекстомПроцедурИФункцийСервер.РазобратьМассивФайловНаСервере(ПараметрыЗапуска);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаТекстовМодулей(Команда)
	Если Не ЗначениеЗаполнено(Объект.ВидЗагрузки) Тогда
		Объект.ВидЗагрузки = 1;
	КонецЕсли;	
	
	АМ_РаботаСТекстомПроцедурИФункцийКлиентСервер.ПрочитатьФайлыИПоместитьДляАнализа(Объект.АдресМассиваОписанияМодулей, ЭтаФорма.УникальныйИдентификатор, Объект.КаталогФайловКонфигурации, Объект.ВидЗагрузки);
	
	ПараметрыЗапуска  = АМ_РаботаСТекстомПроцедурИФункцийКлиентСервер.ПолучитьСтруктуруПараметровЗапускаЗакгрузки();
	ПараметрыЗапуска.Конфигурация = объект.ВыбраннаяКонфигурация;
	ПараметрыЗапуска.НаименованиеМодуля =  объект.ЗагружатьТолькоМодуль;
	ПараметрыЗапуска.НаименованиеМетода = объект.ЗагружатьТолькоМетод;
	ПараметрыЗапуска.АдресСМассивомФайлов = Объект.АдресМассиваОписанияМодулей; 
	ПараметрыЗапуска.ВидЗагрузки = Объект.ВидЗагрузки; 
	
	ЗагрузкаТекстовМодулейНаСервере(ПараметрыЗапуска);
КонецПроцедуры

//&НаКлиенте
//Процедура ПрочитатьФайлыИПоместитьДляАнализа()  
//	РазделительПутиКлиента = ПолучитьРазделительПутиКлиента();
//	ПутьКПапкесОбщимиМодулями = Объект.КаталогФайловКонфигурации + РазделительПутиКлиента+ "CommonModules";
//	
//	МассивФайловМодулей = НайтиФайлы(ПутьКПапкесОбщимиМодулями, ПолучитьМаскуВсеФайлыКлиента(),Истина);
//	
//    ЗаполнитьМассивСтрукутрФайловДляАнализа(МассивФайловМодулей);
//КонецПроцедуры	

//&НаКлиенте
//Процедура ЗаполнитьМассивСтрукутрФайловДляАнализа(МассивФайловМодулей)
//	МассивСтрукутраОписанийМодулей = Новый Массив;
//	Для Каждого ТекЭлементФайл  Из  МассивФайловМодулей Цикл
//		Если ТекЭлементФайл.ЭтоФайл() Тогда
//			СруктураФайлаТек = ПолучитьСтруктуруФайлаКонфы();
//			СруктураФайлаТек.КаталогФайла = ТекЭлементФайл.Путь;
//			СруктураФайлаТек.ИмяФайла = ТекЭлементФайл.ИмяБезРасширения;
//			СруктураФайлаТек.РасширениеФайла = ТекЭлементФайл.Расширение;
//			СруктураФайлаТек.ПолныйПутьФайла = ТекЭлементФайл.ПолноеИмя;
//		
//			ЧтениеТекстаТекФайла = Новый ЧтениеТекста(ТекЭлементФайл.ПолноеИмя);
//			СруктураФайлаТек.ТекстФайла = ЧтениеТекстаТекФайла.Прочитать();
//			МассивСтрукутраОписанийМодулей.Добавить(СруктураФайлаТек);
//		КонецЕсли;	
//	КонецЦикла;
//	Объект.АдресМассиваОписанияМодулей = ПоместитьВоВременноеХранилище(МассивСтрукутраОписанийМодулей, ЭтаФорма.УникальныйИдентификатор);
//КонецПроцедуры

//&НаКлиенте
//Функция ПолучитьСтруктуруФайлаКонфы()
//	
//	Возврат ПолучитьСтруктуруФайлаКонфы_НаСервере();
//КонецФункции

//&НаСервере
//Функция ПолучитьСтруктуруФайлаКонфы_НаСервере()
//	Возврат АМ_РаботаСТекстомПроцедурИФункцийСервер.ПолучитьСтруктуруФайлаКонфы();
//КонецФункции

&НаСервере
Процедура ВыбраннаяКонфигурацияПриИзмененииНаСервере()
	Объект.КаталогФайловКонфигурации = РегистрыСведений.АМ_КаталогиФайловМодулейКонфигураций.ПолучитьКаталогПоКонфигурации(Объект.ВыбраннаяКонфигурация);
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяКонфигурацияПриИзменении(Элемент)
	ВыбраннаяКонфигурацияПриИзмененииНаСервере();
КонецПроцедуры
